---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures.NotCoveredAtAllByTarget
source: html/c1087387-f271-f1fe-bead-edd58d7f97f1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures.NotCoveredAtAllByTarget Property

Highlighted walls are attached to, but miss, the highlighted targets.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotCoveredAtAllByTarget { get; }
```